app/views/subjects/index.html.haml

        %td.center #{status_tag(subject.visible)}
        %td.center=subject.pages.size
---
SELECT COUNT(*) FROM `pages` WHERE (`pages`.subject_id = 5)