app/views/subjects/list.html.haml

        %td.center #{subject.visible ? 'yes' : 'No'}
        %td.center=subject.pages.size
---
SELECT COUNT(*) FROM `pages` WHERE (`pages`.subject_id = 2)