app/controllers/admin_users_controller.rb

  def index
    @admin_users = AdminUser.all
---
SELECT `admin_users`.* FROM `admin_users` ORDER BY admin_users.last_name ASC