app/controllers/admin_users_controller.rb

  def show
    @admin_user = AdminUser.find(params[:id])
---
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 2 LIMIT 1

  def edit
    @admin_user = AdminUser.find(params[:id])
---
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1

  def create
    @admin_user = AdminUser.new(params[:admin_user])

    respond_to do |format|
      if @admin_user.save
---
INSERT INTO `admin_users` (`first_name`, `last_name`, `email`, `hashed_password`, `created_at`, `updated_at`, `username`, `salt`) VALUES ('akita', 'cole', '', 'a24f002933c43134c0b1cbc2e41fa58847db6478', '2011-12-16 18:42:51', '2011-12-16 18:42:51', 'akita_cole', 'f46d107d125dfb864ab050a24c96afed481707fb')

  def update
    @admin_user = AdminUser.find(params[:id])

    respond_to do |format|
      if @admin_user.update_attributes(params[:admin_user])
---
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 1 LIMIT 1
UPDATE `admin_users` SET `first_name` = 'ty', `updated_at` = '2011-12-16 18:07:04' WHERE `admin_users`.`id` = 1

  def destroy
    @admin_user = AdminUser.find(params[:id])
    @admin_user.destroy
---
SELECT `admin_users`.* FROM `admin_users` WHERE `admin_users`.`id` = 3 LIMIT 1
DELETE FROM `admin_users` WHERE `admin_users`.`id` = 3