app/controllers/pages_controller.rb

    def find_subject
      @subject = Subject.find_by_id(params[:subject_id])
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` IS NULL LIMIT 1