app/controllers/subjects_controller.rb

SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC
---
  def list
    #this is for READ part of CRUD
    @subjects = Subject.order("subjects.position ASC")

SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 10 LIMIT 1
---
  def delete
    # THIS THE DESTROY PART OF CRUD
    @subject = Subject.find(params[:id])