app/controllers/subjects_controller.rb

  def index
    @subjects = Subject.order("subjects.position ASC")
---
SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC

  def show
    #this is for READ part of CRUD
    @subject = Subject.find(params[:id])
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 2 LIMIT 1

  def new
    # THIS THE CREATE PART OF CRUD
    @subject = Subject.new
    @subject_count = Subject.count + 1
---
SELECT COUNT(*) FROM `subjects`

  def create
    # THIS THE CREATE PART OF CRUD
    # were going to make a new object with the params sujbect params from form
    @subject = Subject.new(params[:subject])
    # this save the object
    if @subject.save
      #this is if statement for if the form saves
      flash[:notice] = "You have created a new object"
      redirect_to(subjects_path)
    else
      #if it doesnt go back to new action
      @subject_count = Subject.count + 1
---
INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('test subject', 8, 0, '2011-12-01 23:09:54', '2011-12-01 23:09:54')
SELECT COUNT(*) FROM `subjects`

  def edit
    # THIS THE UPDATE PART OF CRUD
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 2 LIMIT 1
SELECT COUNT(*) FROM `subjects`

  def update
    # THIS THE UPDATE PART OF CRUD
    # were going find a object using the params
    @subject = Subject.find(params[:id])
    # this save the object
    if @subject.update_attributes(params[:subject])
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 2 LIMIT 1
UPDATE `subjects` SET `position` = 6, `updated_at` = '2011-12-02 15:45:44' WHERE `subjects`.`id` = 2

  def destroy
    # THIS THE DESTROY PART OF CRUD
    # flash[:notice] = "You have destoryed an object"
    # Subject.find(params[:id]).destroy
    # redirect_to(:action => 'list')
    @subject = Subject.find(params[:id])
    @subject.destroy
---
SELECT `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 10 LIMIT 1
DELETE FROM `subjects` WHERE `subjects`.`id` = 10